//Задача 10 array
Console.Write("Введите трёхзначное число: ");
int IfNumber = Convert.ToInt32(Console.ReadLine());
string IfString = Convert.ToString(IfNumber);
Console.WriteLine("вторая цифра этого числа равна " + IfString[1]);